{
  "name": "Aaron Throckmorton",
  "title": "Senior Software Engineer",
  "summary": "Talented and dedicated full stack developer who is constantly learning new concepts and technologies. Enjoys working with business partners throughout the development lifecycle to ensure requirements are met.  Strong team leader with a natural ability to help team mates solve problems and learn new concepts, as well as learn from those same team members.",
  "overrides": {
    "AdvancedMD": {
      "summary": "Talented and dedicated full stack developer who is constantly learning new concepts and technologies and is knowledgeable in system operation and application interaction. Enjoys working with business partners throughout the development lifecycle to ensure requirements are met.  Strong team leader with a natural ability to help team mates solve problems and learn new concepts, as well as learn from those same team members.",
      "skills": [
        { "skill": "Visual Studio", "rating": 4 }
      ]
    }
  },
  "personalInfo": [
    { "label": "Phone", "value": "(801) 882-9706" },
    { "label": "E-mail", "value": "aaron@throckmortons.com", "link": "mailto" },
    { "label": "LinkedIn", "value": "linkedin.com/in/aaronthrockmorton/", "link": "https://linkedin.com/in/aaronthrockmorton/" },
    { "label": "Resume Source", "value": "github.com/SharpSeeEr/resume", "link": "https://github.com/SharpSeeEr/resume" }
  ],
  "experience": [
    {
      "startYear": "2017",
      "endYear": "",
      "title": "Senior Software Development Engineer",
      "subtitle": "SharpSeer Group, Inc.",
      "description": [
        {
          "format": "ul",
          "items": [
            "Worked with senior management to analyze current loan origination processes. Built an ASP.Net Core and Vue.js application to streamline, manage, and automate them, migrating and converting current loan data from MS Access to MS SQL Server.",
            "Created a loan servicing processing module specific to the clients needs using Python.",
            "Modified Chocolately packages for Keepass and Git to provide custom functionality.  Submitted pull requests were accepted by the maintainers.",
            "Created a custom Clock Picker component for Buefy, a Vue.js component library for the Bulma CSS library, which is now included in the Buefy library.",
            "Published a NuGet package with Entity Framework classes and extensions used across multiple projects."
          ]
        }
      ]
    },
    {
      "startYear": "2011",
      "endYear": "2017",
      "title": "Senior Developer",
      "subtitle": "Wells Fargo Bank, N. A.",
      "description": [
        {
          "format": "ul",
          "items": [
            "Designed, developed, maintained, and supported 4 large internal web applications for the IT support group.",
            "Provide guidance to other developers on team, teaching programming patterns, anti-patterns, and dubugging techniques, and giving general help and direction.",
            "Led weekly and as needed development team meetings to review code and provide help to team mates.",
            "Designed and developed an IT server management system to manage over 30,000 Windows servers. A set of backend services updated system information and deployed configuration and change jobs. A web front end provided IT techs to view server information, create jobs to make changes, and review the results of those jobs.",
            "Developed an application to consolidate asset information from several separate sources enabling access to all data from one interface.",
            "Identified and optimized SQL query operations from custom queries and those generated from Entity Framework.",
            "Created a change management system for end users to request updates to asset data.  The application requested approval from appropriate parties before automatically applying the changes, replacing a manual tracking process requiring several weeks per change, with the new system requiring only a few days."
          ]
        }
      ]
    },
    {
      "pageBreak": true
    },
    {
      "startYear": "2008",
      "endYear": "2011",
      "title": "Systems Administrator",
      "subtitle": "Wells Fargo Securities",
      "description": [
        {
          "format": "ul",
          "items": [
            "Provided desktop, laptop, and server support for 60 users across 8 geographic locations",
            "Included new system setup, server maintenance and backups, break/fix issues, security policy compliance and remediation.",
            "Managed Active Directory, file and print servers, and MS SQL database servers.",
            "Created a custom program to help manage monthly updates."
          ]
        }
      ]
    },
    {
      "startYear": "1999",
      "endYear": "2008",
      "title": "Systems Engineer",
      "subtitle": "Wells Fargo Bank & Company",
      "description": [
        {
          "format": "ul",
          "items": [
            "Responsible for designing, sizing, and installing systems for assigned projects, and ensuring tech personnel received proper training for supporting them.",
            "Escalation point for over 40 on site technicians located across 15 locations."
          ]
        }
      ]
    },
    {
      "startYear": "1992",
      "endYear": "1999",
      "title": "Computer Maintenance Technician",
      "subtitle": "United States Air Force",
      "description": [
        {
          "format": "ul",
          "items": [
            "Maintained all audio, video, and computer equipment in the United States StratCom underground command center in Omaha, NE.",
            "Required a Top Secret SCI security clearance."
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "startYear": "2004",
      "endYear": "2007",
      "title": "University of Phoenix",
      "subtitle": "B.S. Information Technology"
    }
  ],
  "skills": [
    { "skill": "C#", "rating": 5 },
    { "skill": "JavaScript", "rating": 4 },
    { "skill": "SQL", "rating": 4 },
    { "skill": "Python", "rating": 3 },
    { "skill": "HTML, CSS, SCSS, Stylus", "rating": 4 },
    { "skill": "ASP.Net, ASP.Net Core", "rating": 4},
    { "skill": "Vue.js", "rating": 4 },
    { "skill": "Angular", "rating": 1 },
    { "skill": "MS SQL Server", "rating": 4 },
    { "skill": "Windows Server", "rating": 4 },
    { "skill": "Git", "rating": 3 }
  ]
}
